apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_i2c.h
/**************************************************************************//**
 * @file     rtl819bhp_i2c.h
 * @brief    The fundamental definition for RTL8195B HP i2C module.
 * @version  V1.00
 * @date     2017-03-07
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2016 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/



#ifndef _RTL8710C_I2C_H_
#define _RTL8710C_I2C_H_

#include "rtl8710c_i2c_type.h"

#ifdef __cplusplus
extern "C" {
#endif
/**
 * @addtogroup hs_hal_i2c I2C
 * @{
 */

//#define LOCAL_SVD_DECLARATION
#undef LOCAL_SVD_DECLARATION
//this flag should be checked again when system integration is done.

#define TX_ABRT_TEMP_PATCH  //This flag should be removed when tx_abrt bit15 is fixed to a correct hardware in DMA mode

/// i2c module number
#define I2C_NO               1
/// i2c IRQ Priority
#define I2C_IRQ_PR           3
/// i2c address retry time-out
#define I2C_ATRY_TO          3000
/// i2c master mode address retry function
#define I2C_ADD_RETRY        1
/// i2c master mode address retry max count
#define I2C_ADD_RTY_MAX      256
/// i2c default DMA TX src width
#define I2C_DMA_DEFAULT_TX_SRC_WIDTH     4
/// i2c default DMA RX des width
#define I2C_DMA_DEFAULT_RX_DES_WIDTH     4
/// i2c timeout check disabled
#define I2C_TIMEOUT_DISABLE  0x00
/// i2c timeout check endless
#define I2C_TIMEOUT_ENDLESS  0xFFFFFFFF
/// i2c TX FIFO entry number
#define I2C_TX_FIFO_DEPTH    32
/// i2c RX FIFO entry number
#define I2C_RX_FIFO_DEPTH    32
/// i2c DMA transfer max length
#define I2C_DMA_MAX_LEN      4095
/// i2c filter CAP. low length
#define I2C_FLTR_CAP_L_LEN   20
/// i2c filter CAP. main length
#define I2C_FLTR_CAP_M_LEN   5
/// i2c filter Resis. low length
#define I2C_FLTR_RSTS_L_LEN  20
/// i2c filter Resis. main length
#define I2C_FLTR_RSTS_M_LEN  20

/** @defgroup i2c_reg_bit_macro I2C REG BIT MACRO
 *  bit-operation macros for i2c registers
 *  @{
 */
/** @} */ // end of I2C REG BIT MACRO


/*  Bit shift macros for i2c_con_t  */
/** @ingroup i2c_reg_bit_macro
 *  bit-operation macros for IC_SLAVE_DISABLE_1
 *  @{
 */
#define BIT_IC_SLAVE_DISABLE_1                             BIT7
#define BIT_SHIFT_IC_SLAVE_DISABLE_1                       7
#define BIT_MASK_IC_SLAVE_DISABLE_1                        0x1
#define BIT_CTRL_IC_SLAVE_DISABLE_1(x)                     (((x) &  BIT_MASK_IC_SLAVE_DISABLE_1) << BIT_SHIFT_IC_SLAVE_DISABLE_1)
#define BIT_GET_IC_SLAVE_DISABLE_1(x)                      (((x) >>  BIT_SHIFT_IC_SLAVE_DISABLE_1) & BIT_MASK_IC_SLAVE_DISABLE_1)
/** @} */

/** @ingroup i2c_reg_bit_macro
 *  bit-operation macros for IC_SLAVE_DISABLE
 *  @{
 */
#define BIT_IC_SLAVE_DISABLE                               BIT6
#define BIT_SHIFT_IC_SLAVE_DISABLE                         6
#define BIT_MASK_IC_SLAVE_DISABLE                          0x1
#define BIT_CTRL_IC_SLAVE_DISABLE(x)                       (((x) &  BIT_MASK_IC_SLAVE_DISABLE) << BIT_SHIFT_IC_SLAVE_DISABLE)
#define BIT_GET_IC_SLAVE_DISABLE(x)                        (((x) >>  BIT_SHIFT_IC_SLAVE_DISABLE) & BIT_MASK_IC_SLAVE_DISABLE)
/** @} */

/** @ingroup i2c_reg_bit_macro
 *  bit-operation macros for IC_RESTART_EN
 *  @{
 */
#define BIT_IC_RESTART_EN                                  BIT5
#define BIT_SHIFT_IC_RESTART_EN                            5
#define BIT_MASK_IC_RESTART_EN                             0x1
#define BIT_CTRL_IC_RESTART_EN(x)                          (((x) &  BIT_MASK_IC_RESTART_EN) << BIT_SHIFT_IC_RESTART_EN)
#define BIT_GET_IC_RESTART_EN(x)                           (((x) >>  BIT_SHIFT_IC_RESTART_EN) & BIT_MASK_IC_RESTART_EN)
/** @} */

/**
 *  bit-operation macros for IC_10BITADDR_MASTER
 *  @ingroup i2c_reg_bit_macro
 *  @{
 */
#define BIT_IC_10BITADDR_MASTER                            BIT4
#define BIT_SHIFT_IC_10BITADDR_MASTER                      4
#define BIT_MASK_IC_10BITADDR_MASTER                       0x1
#define BIT_CTRL_IC_10BITADDR_MASTER(x)                    (((x) &  BIT_MASK_IC_10BITADDR_MASTER) << BIT_SHIFT_IC_10BITADDR_MASTER)
#define BIT_GET_IC_10BITADDR_MASTER(x)                     (((x) >>  BIT_SHIFT_IC_10BITADDR_MASTER) & BIT_MASK_IC_10BITADDR_MASTER)
/** @} */

/**
 *  bit-operation macros for IC_10BITADDR_SLAVE
 *  @ingroup i2c_reg_bit_macro
 *  @{
 */
#define BIT_IC_10BITADDR_SLAVE                             BIT3
#define BIT_SHIFT_IC_10BITADDR_SLAVE                       3
#define BIT_MASK_IC_10BITADDR_SLAVE                        0x1
#define BIT_CTRL_IC_10BITADDR_SLAVE(x)                     (((x) &  BIT_MASK_IC_10BITADDR_SLAVE) << BIT_SHIFT_IC_10BITADDR_SLAVE)
#define BIT_GET_IC_10BITADDR_SLAVE(x)                      (((x) >>  BIT_SHIFT_IC_10BITADDR_SLAVE) & BIT_MASK_IC_10BITADDR_SLAVE)
/** @} */

/**
 *  bit-operation macros for SPEED
 *  @ingroup i2c_reg_bit_macro
 *  @{
 */
#define BIT_SHIFT_SPEED                                    1
#define BIT_MASK_SPEED                                     0x3
#define BIT_CTRL_SPEED(x)                                  (((x) &  BIT_MASK_SPEED) << BIT_SHIFT_SPEED)
#define BIT_GET_SPEED(x)                                   (((x) >>  BIT_SHIFT_SPEED) & BIT_MASK_SPEED)
/** @} */

/**
 *  bit-operation macros for MASTER_MODE
 *  @ingroup i2c_reg_bit_macro
 *  @{
 */
#define BIT_MASTER_MODE                                    BIT0
#define BIT_SHIFT_MASTER_MODE                              0
#define BIT_MASK_MASTER_MODE                               0x1
#define BIT_CTRL_MASTER_MODE(x)                            (((x) &  BIT_MASK_MASTER_MODE) << BIT_SHIFT_MASTER_MODE)
#define BIT_GET_MASTER_MODE(x)                             (((x) >>  BIT_SHIFT_MASTER_MODE) & BIT_MASK_MASTER_MODE)
/** @} */


/*  Bit shift macros for i2c_dat_cmd_t  */
/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for NULL_DATA
 *  @{
 */
#define BIT_NULL_DATA                                      BIT11
#define BIT_SHIFT_NULL_DATA                                11
#define BIT_MASK_NULL_DATA                                 0x1
#define BIT_CTRL_NULL_DATA(x)                              (((x) &  BIT_MASK_NULL_DATA) << BIT_SHIFT_NULL_DATA)
#define BIT_GET_NULL_DATA(x)                               (((x) >>  BIT_SHIFT_NULL_DATA) & BIT_MASK_NULL_DATA)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RESTART
 *  @{
 */
#define BIT_RESTART                                        BIT10
#define BIT_SHIFT_RESTART                                  10
#define BIT_MASK_RESTART                                   0x1
#define BIT_CTRL_RESTART(x)                                (((x) &  BIT_MASK_RESTART) << BIT_SHIFT_RESTART)
#define BIT_GET_RESTART(x)                                 (((x) >>  BIT_SHIFT_RESTART) & BIT_MASK_RESTART)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for STOP
 *  @{
 */
#define BIT_STOP                                           BIT9
#define BIT_SHIFT_STOP                                     9
#define BIT_MASK_STOP                                      0x1
#define BIT_CTRL_STOP(x)                                   (((x) &  BIT_MASK_STOP) << BIT_SHIFT_STOP)
#define BIT_GET_STOP(x)                                    (((x) >>  BIT_SHIFT_STOP) & BIT_MASK_STOP)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for CMD
 *  @{
 */
#define BIT_CMD                                            BIT8
#define BIT_SHIFT_CMD                                      8
#define BIT_MASK_CMD                                       0x1
#define BIT_CTRL_CMD(x)                                    (((x) &  BIT_MASK_CMD) << BIT_SHIFT_CMD)
#define BIT_GET_CMD(x)                                     (((x) >>  BIT_SHIFT_CMD) & BIT_MASK_CMD)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for DAT
 *  @{
 */
#define BIT_SHIFT_DAT                                      0
#define BIT_MASK_DAT                                       0xFF
#define BIT_CTRL_DAT(x)                                    (((x) &  BIT_MASK_DAT) << BIT_SHIFT_DAT)
#define BIT_GET_DAT(x)                                     (((x) >>  BIT_SHIFT_DAT) & BIT_MASK_DAT)
/** @} */

/*  Bit shift macros for i2c_intr_msk_t  */
/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_DMA_I2C_DONE
 *  @{
 */
#define BIT_M_DMA_I2C_DONE                                 BIT15
#define BIT_SHIFT_M_DMA_I2C_DONE                           15
#define BIT_MASK_M_DMA_I2C_DONE                            0x1
#define BIT_CTRL_M_DMA_I2C_DONE(x)                         (((x) &  BIT_MASK_M_DMA_I2C_DONE) << BIT_SHIFT_M_DMA_I2C_DONE)
#define BIT_GET_M_DMA_I2C_DONE(x)                          (((x) >>  BIT_SHIFT_M_DMA_I2C_DONE) & BIT_MASK_M_DMA_I2C_DONE)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_MS_CODE_DET
 *  @{
 */
#define BIT_M_MS_CODE_DET                                  BIT14
#define BIT_SHIFT_M_MS_CODE_DET                            14
#define BIT_MASK_M_MS_CODE_DET                             0x1
#define BIT_CTRL_M_MS_CODE_DET(x)                          (((x) &  BIT_MASK_M_MS_CODE_DET) << BIT_SHIFT_M_MS_CODE_DET)
#define BIT_GET_M_MS_CODE_DET(x)                           (((x) >>  BIT_SHIFT_M_MS_CODE_DET) & BIT_MASK_M_MS_CODE_DET)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_ADDR_1_MATCH
 *  @{
 */
#define BIT_M_ADDR_1_MATCH                                 BIT13
#define BIT_SHIFT_M_ADDR_1_MATCH                           13
#define BIT_MASK_M_ADDR_1_MATCH                            0x1
#define BIT_CTRL_M_ADDR_1_MATCH(x)                         (((x) &  BIT_MASK_M_ADDR_1_MATCH) << BIT_SHIFT_M_ADDR_1_MATCH)
#define BIT_GET_M_ADDR_1_MATCH(x)                          (((x) >>  BIT_SHIFT_M_ADDR_1_MATCH) & BIT_MASK_M_ADDR_1_MATCH)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_ADDR_0_MATCH
 *  @{
 */
#define BIT_M_ADDR_0_MATCH                                 BIT12
#define BIT_SHIFT_M_ADDR_0_MATCH                           12
#define BIT_MASK_M_ADDR_0_MATCH                            0x1
#define BIT_CTRL_M_ADDR_0_MATCH(x)                         (((x) &  BIT_MASK_M_ADDR_0_MATCH) << BIT_SHIFT_M_ADDR_0_MATCH)
#define BIT_GET_M_ADDR_0_MATCH(x)                          (((x) >>  BIT_SHIFT_M_ADDR_0_MATCH) & BIT_MASK_M_ADDR_0_MATCH)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_GEN_CALL
 *  @{
 */
#define BIT_M_GEN_CALL                                     BIT11
#define BIT_SHIFT_M_GEN_CALL                               11
#define BIT_MASK_M_GEN_CALL                                0x1
#define BIT_CTRL_M_GEN_CALL(x)                             (((x) &  BIT_MASK_M_GEN_CALL) << BIT_SHIFT_M_GEN_CALL)
#define BIT_GET_M_GEN_CALL(x)                              (((x) >>  BIT_SHIFT_M_GEN_CALL) & BIT_MASK_M_GEN_CALL)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_START_DET
 *  @{
 */
#define BIT_M_START_DET                                    BIT10
#define BIT_SHIFT_M_START_DET                              10
#define BIT_MASK_M_START_DET                               0x1
#define BIT_CTRL_M_START_DET(x)                            (((x) &  BIT_MASK_M_START_DET) << BIT_SHIFT_M_START_DET)
#define BIT_GET_M_START_DET(x)                             (((x) >>  BIT_SHIFT_M_START_DET) & BIT_MASK_M_START_DET)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_STOP_DET
 *  @{
 */
#define BIT_M_STOP_DET                                     BIT9
#define BIT_SHIFT_M_STOP_DET                               9
#define BIT_MASK_M_STOP_DET                                0x1
#define BIT_CTRL_M_STOP_DET(x)                             (((x) &  BIT_MASK_M_STOP_DET) << BIT_SHIFT_M_STOP_DET)
#define BIT_GET_M_STOP_DET(x)                              (((x) >>  BIT_SHIFT_M_STOP_DET) & BIT_MASK_M_STOP_DET)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_ACTIVITY
 *  @{
 */
#define BIT_M_ACTIVITY                                     BIT8
#define BIT_SHIFT_M_ACTIVITY                               8
#define BIT_MASK_M_ACTIVITY                                0x1
#define BIT_CTRL_M_ACTIVITY(x)                             (((x) &  BIT_MASK_M_ACTIVITY) << BIT_SHIFT_M_ACTIVITY)
#define BIT_GET_M_ACTIVITY(x)                              (((x) >>  BIT_SHIFT_M_ACTIVITY) & BIT_MASK_M_ACTIVITY)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_RX_DONE
 *  @{
 */
#define BIT_M_RX_DONE                                      BIT7
#define BIT_SHIFT_M_RX_DONE                                7
#define BIT_MASK_M_RX_DONE                                 0x1
#define BIT_CTRL_M_RX_DONE(x)                              (((x) &  BIT_MASK_M_RX_DONE) << BIT_SHIFT_M_RX_DONE)
#define BIT_GET_M_RX_DONE(x)                               (((x) >>  BIT_SHIFT_M_RX_DONE) & BIT_MASK_M_RX_DONE)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_TX_ABRT
 *  @{
 */
#define BIT_M_TX_ABRT                                      BIT6
#define BIT_SHIFT_M_TX_ABRT                                6
#define BIT_MASK_M_TX_ABRT                                 0x1
#define BIT_CTRL_M_TX_ABRT(x)                              (((x) &  BIT_MASK_M_TX_ABRT) << BIT_SHIFT_M_TX_ABRT)
#define BIT_GET_M_TX_ABRT(x)                               (((x) >>  BIT_SHIFT_M_TX_ABRT) & BIT_MASK_M_TX_ABRT)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_RD_REQ
 *  @{
 */
#define BIT_M_RD_REQ                                       BIT5
#define BIT_SHIFT_M_RD_REQ                                 5
#define BIT_MASK_M_RD_REQ                                  0x1
#define BIT_CTRL_M_RD_REQ(x)                               (((x) &  BIT_MASK_M_RD_REQ) << BIT_SHIFT_M_RD_REQ)
#define BIT_GET_M_RD_REQ(x)                                (((x) >>  BIT_SHIFT_M_RD_REQ) & BIT_MASK_M_RD_REQ)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_TX_EMPTY
 *  @{
 */
#define BIT_M_TX_EMPTY                                     BIT4
#define BIT_SHIFT_M_TX_EMPTY                               4
#define BIT_MASK_M_TX_EMPTY                                0x1
#define BIT_CTRL_M_TX_EMPTY(x)                             (((x) &  BIT_MASK_M_TX_EMPTY) << BIT_SHIFT_M_TX_EMPTY)
#define BIT_GET_M_TX_EMPTY(x)                              (((x) >>  BIT_SHIFT_M_TX_EMPTY) & BIT_MASK_M_TX_EMPTY)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_TX_OVER
 *  @{
 */
#define BIT_M_TX_OVER                                      BIT3
#define BIT_SHIFT_M_TX_OVER                                3
#define BIT_MASK_M_TX_OVER                                 0x1
#define BIT_CTRL_M_TX_OVER(x)                              (((x) &  BIT_MASK_M_TX_OVER) << BIT_SHIFT_M_TX_OVER)
#define BIT_GET_M_TX_OVER(x)                               (((x) >>  BIT_SHIFT_M_TX_OVER) & BIT_MASK_M_TX_OVER)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_RX_FULL
 *  @{
 */
#define BIT_M_RX_FULL                                      BIT2
#define BIT_SHIFT_M_RX_FULL                                2
#define BIT_MASK_M_RX_FULL                                 0x1
#define BIT_CTRL_M_RX_FULL(x)                              (((x) &  BIT_MASK_M_RX_FULL) << BIT_SHIFT_M_RX_FULL)
#define BIT_GET_M_RX_FULL(x)                               (((x) >>  BIT_SHIFT_M_RX_FULL) & BIT_MASK_M_RX_FULL)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_RX_OVER
 *  @{
 */
#define BIT_M_RX_OVER                                      BIT1
#define BIT_SHIFT_M_RX_OVER                                1
#define BIT_MASK_M_RX_OVER                                 0x1
#define BIT_CTRL_M_RX_OVER(x)                              (((x) &  BIT_MASK_M_RX_OVER) << BIT_SHIFT_M_RX_OVER)
#define BIT_GET_M_RX_OVER(x)                               (((x) >>  BIT_SHIFT_M_RX_OVER) & BIT_MASK_M_RX_OVER)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for M_RX_UNDER
 *  @{
 */
#define BIT_M_RX_UNDER                                     BIT0
#define BIT_SHIFT_M_RX_UNDER                               0
#define BIT_MASK_M_RX_UNDER                                0x1
#define BIT_CTRL_M_RX_UNDER(x)                             (((x) &  BIT_MASK_M_RX_UNDER) << BIT_SHIFT_M_RX_UNDER)
#define BIT_GET_M_RX_UNDER(x)                              (((x) >>  BIT_SHIFT_M_RX_UNDER) & BIT_MASK_M_RX_UNDER)
/** @} */

/*  Bit shift macros for i2c_raw_intr_stat_t  */
/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_DMA_I2C_DONE
 *  @{
 */
#define BIT_RAW_DMA_I2C_DONE                               BIT15
#define BIT_SHIFT_RAW_DMA_I2C_DONE                         15
#define BIT_MASK_RAW_DMA_I2C_DONE                          0x1
#define BIT_CTRL_RAW_DMA_I2C_DONE(x)                       (((x) &  BIT_MASK_RAW_DMA_I2C_DONE) << BIT_SHIFT_RAW_DMA_I2C_DONE)
#define BIT_GET_RAW_DMA_I2C_DONE(x)                        (((x) >>  BIT_SHIFT_RAW_DMA_I2C_DONE) & BIT_MASK_RAW_DMA_I2C_DONE)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_MS_CODE_DET
 *  @{
 */
#define BIT_RAW_MS_CODE_DET                                BIT14
#define BIT_SHIFT_RAW_MS_CODE_DET                          14
#define BIT_MASK_RAW_MS_CODE_DET                           0x1
#define BIT_CTRL_RAW_MS_CODE_DET(x)                        (((x) &  BIT_MASK_RAW_MS_CODE_DET) << BIT_SHIFT_RAW_MS_CODE_DET)
#define BIT_GET_RAW_MS_CODE_DET(x)                         (((x) >>  BIT_SHIFT_RAW_MS_CODE_DET) & BIT_MASK_RAW_MS_CODE_DET)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_ADDR_1_MATCH
 *  @{
 */
#define BIT_RAW_ADDR_1_MATCH                               BIT13
#define BIT_SHIFT_RAW_ADDR_1_MATCH                         13
#define BIT_MASK_RAW_ADDR_1_MATCH                          0x1
#define BIT_CTRL_RAW_ADDR_1_MATCH(x)                       (((x) &  BIT_MASK_RAW_ADDR_1_MATCH) << BIT_SHIFT_RAW_ADDR_1_MATCH)
#define BIT_GET_RAW_ADDR_1_MATCH(x)                        (((x) >>  BIT_SHIFT_RAW_ADDR_1_MATCH) & BIT_MASK_RAW_ADDR_1_MATCH)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_ADDR_0_MATCH
 *  @{
 */
#define BIT_RAW_ADDR_0_MATCH                               BIT12
#define BIT_SHIFT_RAW_ADDR_0_MATCH                         12
#define BIT_MASK_RAW_ADDR_0_MATCH                          0x1
#define BIT_CTRL_RAW_ADDR_0_MATCH(x)                       (((x) &  BIT_MASK_RAW_ADDR_0_MATCH) << BIT_SHIFT_RAW_ADDR_0_MATCH)
#define BIT_GET_RAW_ADDR_0_MATCH(x)                        (((x) >>  BIT_SHIFT_RAW_ADDR_0_MATCH) & BIT_MASK_RAW_ADDR_0_MATCH)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_GEN_CALL
 *  @{
 */
#define BIT_RAW_GEN_CALL                                   BIT11
#define BIT_SHIFT_RAW_GEN_CALL                             11
#define BIT_MASK_RAW_GEN_CALL                              0x1
#define BIT_CTRL_RAW_GEN_CALL(x)                           (((x) &  BIT_MASK_RAW_GEN_CALL) << BIT_SHIFT_RAW_GEN_CALL)
#define BIT_GET_RAW_GEN_CALL(x)                            (((x) >>  BIT_SHIFT_RAW_GEN_CALL) & BIT_MASK_RAW_GEN_CALL)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_START_DET
 *  @{
 */
#define BIT_RAW_START_DET                                  BIT10
#define BIT_SHIFT_RAW_START_DET                            10
#define BIT_MASK_RAW_START_DET                             0x1
#define BIT_CTRL_RAW_START_DET(x)                          (((x) &  BIT_MASK_RAW_START_DET) << BIT_SHIFT_RAW_START_DET)
#define BIT_GET_RAW_START_DET(x)                           (((x) >>  BIT_SHIFT_RAW_START_DET) & BIT_MASK_RAW_START_DET)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_STOP_DET
 *  @{
 */
#define BIT_RAW_STOP_DET                                   BIT9
#define BIT_SHIFT_RAW_STOP_DET                             9
#define BIT_MASK_RAW_STOP_DET                              0x1
#define BIT_CTRL_RAW_STOP_DET(x)                           (((x) &  BIT_MASK_RAW_STOP_DET) << BIT_SHIFT_RAW_STOP_DET)
#define BIT_GET_RAW_STOP_DET(x)                            (((x) >>  BIT_SHIFT_RAW_STOP_DET) & BIT_MASK_RAW_STOP_DET)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_ACTIVITY
 *  @{
 */
#define BIT_RAW_ACTIVITY                                   BIT8
#define BIT_SHIFT_RAW_ACTIVITY                             8
#define BIT_MASK_RAW_ACTIVITY                              0x1
#define BIT_CTRL_RAW_ACTIVITY(x)                           (((x) &  BIT_MASK_RAW_ACTIVITY) << BIT_SHIFT_RAW_ACTIVITY)
#define BIT_GET_RAW_ACTIVITY(x)                            (((x) >>  BIT_SHIFT_RAW_ACTIVITY) & BIT_MASK_RAW_ACTIVITY)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_RX_DONE
 *  @{
 */
#define BIT_RAW_RX_DONE                                    BIT7
#define BIT_SHIFT_RAW_RX_DONE                              7
#define BIT_MASK_RAW_RX_DONE                               0x1
#define BIT_CTRL_RAW_RX_DONE(x)                            (((x) &  BIT_MASK_RAW_RX_DONE) << BIT_SHIFT_RAW_RX_DONE)
#define BIT_GET_RAW_RX_DONE(x)                             (((x) >>  BIT_SHIFT_RAW_RX_DONE) & BIT_MASK_RAW_RX_DONE)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_TX_ABRT
 *  @{
 */
#define BIT_RAW_TX_ABRT                                    BIT6
#define BIT_SHIFT_RAW_TX_ABRT                              6
#define BIT_MASK_RAW_TX_ABRT                               0x1
#define BIT_CTRL_RAW_TX_ABRT(x)                            (((x) &  BIT_MASK_RAW_TX_ABRT) << BIT_SHIFT_RAW_TX_ABRT)
#define BIT_GET_RAW_TX_ABRT(x)                             (((x) >>  BIT_SHIFT_RAW_TX_ABRT) & BIT_MASK_RAW_TX_ABRT)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_RD_REQ
 *  @{
 */
#define BIT_RAW_RD_REQ                                     BIT5
#define BIT_SHIFT_RAW_RD_REQ                               5
#define BIT_MASK_RAW_RD_REQ                                0x1
#define BIT_CTRL_RAW_RD_REQ(x)                             (((x) &  BIT_MASK_RAW_RD_REQ) << BIT_SHIFT_RAW_RD_REQ)
#define BIT_GET_RAW_RD_REQ(x)                              (((x) >>  BIT_SHIFT_RAW_RD_REQ) & BIT_MASK_RAW_RD_REQ)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_TX_EMPTY
 *  @{
 */
#define BIT_RAW_TX_EMPTY                                   BIT4
#define BIT_SHIFT_RAW_TX_EMPTY                             4
#define BIT_MASK_RAW_TX_EMPTY                              0x1
#define BIT_CTRL_RAW_TX_EMPTY(x)                           (((x) &  BIT_MASK_RAW_TX_EMPTY) << BIT_SHIFT_RAW_TX_EMPTY)
#define BIT_GET_RAW_TX_EMPTY(x)                            (((x) >>  BIT_SHIFT_RAW_TX_EMPTY) & BIT_MASK_RAW_TX_EMPTY)
/** @} */

