apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_i2c.h
/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_TX_OVER
 *  @{
 */
#define BIT_RAW_TX_OVER                                    BIT3
#define BIT_SHIFT_RAW_TX_OVER                              3
#define BIT_MASK_RAW_TX_OVER                               0x1
#define BIT_CTRL_RAW_TX_OVER(x)                            (((x) &  BIT_MASK_RAW_TX_OVER) << BIT_SHIFT_RAW_TX_OVER)
#define BIT_GET_RAW_TX_OVER(x)                             (((x) >>  BIT_SHIFT_RAW_TX_OVER) & BIT_MASK_RAW_TX_OVER)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_RX_FULL
 *  @{
 */
#define BIT_RAW_RX_FULL                                    BIT2
#define BIT_SHIFT_RAW_RX_FULL                              2
#define BIT_MASK_RAW_RX_FULL                               0x1
#define BIT_CTRL_RAW_RX_FULL(x)                            (((x) &  BIT_MASK_RAW_RX_FULL) << BIT_SHIFT_RAW_RX_FULL)
#define BIT_GET_RAW_RX_FULL(x)                             (((x) >>  BIT_SHIFT_RAW_RX_FULL) & BIT_MASK_RAW_RX_FULL)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_RX_OVER
 *  @{
 */
#define BIT_RAW_RX_OVER                                    BIT1
#define BIT_SHIFT_RAW_RX_OVER                              1
#define BIT_MASK_RAW_RX_OVER                               0x1
#define BIT_CTRL_RAW_RX_OVER(x)                            (((x) &  BIT_MASK_RAW_RX_OVER) << BIT_SHIFT_RAW_RX_OVER)
#define BIT_GET_RAW_RX_OVER(x)                             (((x) >>  BIT_SHIFT_RAW_RX_OVER) & BIT_MASK_RAW_RX_OVER)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RAW_RX_UNDER
 *  @{
 */
#define BIT_RAW_RX_UNDER                                   BIT0
#define BIT_SHIFT_RAW_RX_UNDER                             0
#define BIT_MASK_RAW_RX_UNDER                              0x1
#define BIT_CTRL_RAW_RX_UNDER(x)                           (((x) &  BIT_MASK_RAW_RX_UNDER) << BIT_SHIFT_RAW_RX_UNDER)
#define BIT_GET_RAW_RX_UNDER(x)                            (((x) >>  BIT_SHIFT_RAW_RX_UNDER) & BIT_MASK_RAW_RX_UNDER)
/** @} */

/*  Bit shift macros for i2c_sts_t  */
/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for BUS_STATUS
 *  @{
 */
#define BIT_SHIFT_BUS_STATUS                               BIT11
#define BIT_MASK_BUS_STATUS                                0x3
#define BIT_CTRL_BUS_STATUS(x)                             (((x) &  BIT_MASK_BUS_STATUS) << BIT_SHIFT_BUS_STATUS)
#define BIT_GET_BUS_STATUS(x)                              (((x) >>  BIT_SHIFT_BUS_STATUS) & BIT_MASK_BUS_STATUS)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for SLV_HOLD_RX_FIFO_FULL
 *  @{
 */
#define BIT_SLV_HOLD_RX_FIFO_FULL                          BIT10
#define BIT_SHIFT_SLV_HOLD_RX_FIFO_FULL                    10
#define BIT_MASK_SLV_HOLD_RX_FIFO_FULL                     0x1
#define BIT_CTRL_SLV_HOLD_RX_FIFO_FULL(x)                  (((x) &  BIT_MASK_SLV_HOLD_RX_FIFO_FULL) << BIT_SHIFT_SLV_HOLD_RX_FIFO_FULL)
#define BIT_GET_SLV_HOLD_RX_FIFO_FULL(x)                   (((x) >>  BIT_SHIFT_SLV_HOLD_RX_FIFO_FULL) & BIT_MASK_SLV_HOLD_RX_FIFO_FULL)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for SLV_HOLD_TX_FIFO_EMPTY
 *  @{
 */
#define BIT_SLV_HOLD_TX_FIFO_EMPTY                         BIT9
#define BIT_SHIFT_SLV_HOLD_TX_FIFO_EMPTY                   9
#define BIT_MASK_SLV_HOLD_TX_FIFO_EMPTY                    0x1
#define BIT_CTRL_SLV_HOLD_TX_FIFO_EMPTY(x)                 (((x) &  BIT_MASK_SLV_HOLD_TX_FIFO_EMPTY) << BIT_SHIFT_SLV_HOLD_TX_FIFO_EMPTY)
#define BIT_GET_SLV_HOLD_TX_FIFO_EMPTY(x)                  (((x) >>  BIT_SHIFT_SLV_HOLD_TX_FIFO_EMPTY) & BIT_MASK_SLV_HOLD_TX_FIFO_EMPTY)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for MST_HOLD_RX_FIFO_FULL
 *  @{
 */
#define BIT_MST_HOLD_RX_FIFO_FULL                          BIT8
#define BIT_SHIFT_MST_HOLD_RX_FIFO_FULL                    8
#define BIT_MASK_MST_HOLD_RX_FIFO_FULL                     0x1
#define BIT_CTRL_MST_HOLD_RX_FIFO_FULL(x)                  (((x) &  BIT_MASK_MST_HOLD_RX_FIFO_FULL) << BIT_SHIFT_MST_HOLD_RX_FIFO_FULL)
#define BIT_GET_MST_HOLD_RX_FIFO_FULL(x)                   (((x) >>  BIT_SHIFT_MST_HOLD_RX_FIFO_FULL) & BIT_MASK_MST_HOLD_RX_FIFO_FULL)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for MST_HOLD_TX_FIFO_EMPTY
 *  @{
 */
#define BIT_MST_HOLD_TX_FIFO_EMPTY                         BIT7
#define BIT_SHIFT_MST_HOLD_TX_FIFO_EMPTY                   7
#define BIT_MASK_MST_HOLD_TX_FIFO_EMPTY                    0x1
#define BIT_CTRL_MST_HOLD_TX_FIFO_EMPTY(x)                 (((x) &  BIT_MASK_MST_HOLD_TX_FIFO_EMPTY) << BIT_SHIFT_MST_HOLD_TX_FIFO_EMPTY)
#define BIT_GET_MST_HOLD_TX_FIFO_EMPTY(x)                  (((x) >>  BIT_SHIFT_MST_HOLD_TX_FIFO_EMPTY) & BIT_MASK_MST_HOLD_TX_FIFO_EMPTY)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for SLV_ACTIVITY
 *  @{
 */
#define BIT_SLV_ACTIVITY                                   BIT6
#define BIT_SHIFT_SLV_ACTIVITY                             6
#define BIT_MASK_SLV_ACTIVITY                              0x1
#define BIT_CTRL_SLV_ACTIVITY(x)                           (((x) &  BIT_MASK_SLV_ACTIVITY) << BIT_SHIFT_SLV_ACTIVITY)
#define BIT_GET_SLV_ACTIVITY(x)                            (((x) >>  BIT_SHIFT_SLV_ACTIVITY) & BIT_MASK_SLV_ACTIVITY)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for MST_ACTIVITY
 *  @{
 */
#define BIT_MST_ACTIVITY                                   BIT5
#define BIT_SHIFT_MST_ACTIVITY                             5
#define BIT_MASK_MST_ACTIVITY                              0x1
#define BIT_CTRL_MST_ACTIVITY(x)                           (((x) &  BIT_MASK_MST_ACTIVITY) << BIT_SHIFT_MST_ACTIVITY)
#define BIT_GET_MST_ACTIVITY(x)                            (((x) >>  BIT_SHIFT_MST_ACTIVITY) & BIT_MASK_MST_ACTIVITY)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RFF
 *  @{
 */
#define BIT_IC_RFF                                         BIT4
#define BIT_SHIFT_IC_RFF                                   4
#define BIT_MASK_IC_RFF                                    0x1
#define BIT_CTRL_IC_RFF(x)                                 (((x) &  BIT_MASK_IC_RFF) << BIT_SHIFT_IC_RFF)
#define BIT_GET_IC_RFF(x)                                  (((x) >>  BIT_SHIFT_IC_RFF) & BIT_MASK_IC_RFF)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for RFNE
 *  @{
 */
#define BIT_IC_RFNE                                        BIT3
#define BIT_SHIFT_IC_RFNE                                  3
#define BIT_MASK_IC_RFNE                                   0x1
#define BIT_CTRL_IC_RFNE(x)                                (((x) &  BIT_MASK_IC_RFNE) << BIT_SHIFT_IC_RFNE)
#define BIT_GET_IC_RFNE(x)                                 (((x) >>  BIT_SHIFT_IC_RFNE) & BIT_MASK_IC_RFNE)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for TFE
 *  @{
 */
#define BIT_IC_TFE                                         BIT2
#define BIT_SHIFT_IC_TFE                                   2
#define BIT_MASK_IC_TFE                                    0x1
#define BIT_CTRL_IC_TFE(x)                                 (((x) &  BIT_MASK_IC_TFE) << BIT_SHIFT_IC_TFE)
#define BIT_GET_IC_TFE(x)                                  (((x) >>  BIT_SHIFT_IC_TFE) & BIT_MASK_IC_TFE)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for TFNF
 *  @{
 */
#define BIT_IC_TFNF                                        BIT1
#define BIT_SHIFT_IC_TFNF                                  1
#define BIT_MASK_IC_TFNF                                   0x1
#define BIT_CTRL_IC_TFNF(x)                                (((x) &  BIT_MASK_IC_TFNF) << BIT_SHIFT_IC_TFNF)
#define BIT_GET_IC_TFNF(x)                                 (((x) >>  BIT_SHIFT_IC_TFNF) & BIT_MASK_IC_TFNF)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ACTIVITY
 *  @{
 */
#define BIT_ACTIVITY                                       BIT0
#define BIT_SHIFT_ACTIVITY                                 0
#define BIT_MASK_ACTIVITY                                  0x1
#define BIT_CTRL_ACTIVITY(x)                               (((x) &  BIT_MASK_ACTIVITY) << BIT_SHIFT_ACTIVITY)
#define BIT_GET_ACTIVITY(x)                                (((x) >>  BIT_SHIFT_ACTIVITY) & BIT_MASK_ACTIVITY)
/** @} */

/*  Bit shift macros for i2c_dma_cmd_t  */
/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for IC_DMA_RESTART
 *  @{
 */
#define BIT_IC_DMA_RESTART                                 BIT7
#define BIT_SHIFT_IC_DMA_RESTART                           7
#define BIT_MASK_IC_DMA_RESTART                            0x1
#define BIT_CTRL_IC_DMA_RESTART(x)                         (((x) &  BIT_MASK_IC_DMA_RESTART) << BIT_SHIFT_IC_DMA_RESTART)
#define BIT_GET_IC_DMA_RESTART(x)                          (((x) >>  BIT_SHIFT_IC_DMA_RESTART) & BIT_MASK_IC_DMA_RESTART)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for IC_DMA_STOP
 *  @{
 */
#define BIT_IC_DMA_STOP                                    BIT6
#define BIT_SHIFT_IC_DMA_STOP                              6
#define BIT_MASK_IC_DMA_STOP                               0x1
#define BIT_CTRL_IC_DMA_STOP(x)                            (((x) &  BIT_MASK_IC_DMA_STOP) << BIT_SHIFT_IC_DMA_STOP)
#define BIT_GET_IC_DMA_STOP(x)                             (((x) >>  BIT_SHIFT_IC_DMA_STOP) & BIT_MASK_IC_DMA_STOP)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for IC_DMA_RW_CMD
 *  @{
 */
#define BIT_IC_DMA_RW_CMD                                  BIT5
#define BIT_SHIFT_IC_DMA_RW_CMD                            5
#define BIT_MASK_IC_DMA_RW_CMD                             0x1
#define BIT_CTRL_IC_DMA_RW_CMD(x)                          (((x) &  BIT_MASK_IC_DMA_RW_CMD) << BIT_SHIFT_IC_DMA_RW_CMD)
#define BIT_GET_IC_DMA_RW_CMD(x)                           (((x) >>  BIT_SHIFT_IC_DMA_RW_CMD) & BIT_MASK_IC_DMA_RW_CMD)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for IC_DMA_MODE_EN
 *  @{
 */
#define BIT_IC_DMA_MODE_EN                                 BIT0
#define BIT_SHIFT_IC_DMA_MODE_EN                           0
#define BIT_MASK_IC_DMA_MODE_EN                            0x1
#define BIT_CTRL_IC_DMA_MODE_EN(x)                         (((x) &  BIT_MASK_IC_DMA_MODE_EN) << BIT_SHIFT_IC_DMA_MODE_EN)
#define BIT_GET_IC_DMA_MODE_EN(x)                          (((x) >>  BIT_SHIFT_IC_DMA_MODE_EN) & BIT_MASK_IC_DMA_MODE_EN)
/** @} */

/*  Bit shift macros for i2c_tx_abrt_src_t  */
/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ABRT_SLVRD_INTX
 *  @{
 */
#define BIT_ABRT_SLVRD_INTX                                BIT15
#define BIT_SHIFT_ABRT_SLVRD_INTX                          15
#define BIT_MASK_ABRT_SLVRD_INTX                           0x1
#define BIT_CTRL_ABRT_SLVRD_INTX(x)                        (((x) &  BIT_MASK_ABRT_SLVRD_INTX) << BIT_SHIFT_ABRT_SLVRD_INTX)
#define BIT_GET_ABRT_SLVRD_INTX(x)                         (((x) >>  BIT_SHIFT_ABRT_SLVRD_INTX) & BIT_MASK_ABRT_SLVRD_INTX)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ABRT_SLV_ARBLOST
 *  @{
 */
#define BIT_ABRT_SLV_ARBLOST                               BIT14
#define BIT_SHIFT_ABRT_SLV_ARBLOST                         14
#define BIT_MASK_ABRT_SLV_ARBLOST                          0x1
#define BIT_CTRL_ABRT_SLV_ARBLOST(x)                       (((x) &  BIT_MASK_ABRT_SLV_ARBLOST) << BIT_SHIFT_ABRT_SLV_ARBLOST)
#define BIT_GET_ABRT_SLV_ARBLOST(x)                        (((x) >>  BIT_SHIFT_ABRT_SLV_ARBLOST) & BIT_MASK_ABRT_SLV_ARBLOST)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ABRT_SLVFLUSH_TXFIFO
 *  @{
 */
#define BIT_ABRT_SLVFLUSH_TXFIFO                           BIT13
#define BIT_SHIFT_ABRT_SLVFLUSH_TXFIFO                     13
#define BIT_MASK_ABRT_SLVFLUSH_TXFIFO                      0x1
#define BIT_CTRL_ABRT_SLVFLUSH_TXFIFO(x)                   (((x) &  BIT_MASK_ABRT_SLVFLUSH_TXFIFO) << BIT_SHIFT_ABRT_SLVFLUSH_TXFIFO)
#define BIT_GET_ABRT_SLVFLUSH_TXFIFO(x)                    (((x) >>  BIT_SHIFT_ABRT_SLVFLUSH_TXFIFO) & BIT_MASK_ABRT_SLVFLUSH_TXFIFO)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ARB_LOST
 *  @{
 */
#define BIT_ARB_LOST                                       BIT12
#define BIT_SHIFT_ARB_LOST                                 12
#define BIT_MASK_ARB_LOST                                  0x1
#define BIT_CTRL_ARB_LOST(x)                               (((x) &  BIT_MASK_ARB_LOST) << BIT_SHIFT_ARB_LOST)
#define BIT_GET_ARB_LOST(x)                                (((x) >>  BIT_SHIFT_ARB_LOST) & BIT_MASK_ARB_LOST)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ABRT_MST_DIS
 *  @{
 */
#define BIT_ABRT_MST_DIS                                    BIT11
#define BIT_SHIFT_ABRT_MST_DIS                              11
#define BIT_MASK_ABRT_MST_DIS                               0x1
#define BIT_CTRL_ABRT_MST_DIS(x)                            (((x) &  BIT_MASK_ABRT_MST_DIS) << BIT_SHIFT_ABRT_MST_DIS)
#define BIT_GET_ABRT_MST_DIS(x)                             (((x) >>  BIT_SHIFT_ABRT_MST_DIS) & BIT_MASK_ABRT_MST_DIS)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ABRT_NORSTRT_10BIT_RD
 *  @{
 */
#define BIT_ABRT_NORSTRT_10BIT_RD                           BIT10
#define BIT_SHIFT_ABRT_NORSTRT_10BIT_RD                     10
#define BIT_MASK_ABRT_NORSTRT_10BIT_RD                      0x1
#define BIT_CTRL_ABRT_NORSTRT_10BIT_RD(x)                   (((x) &  BIT_MASK_ABRT_NORSTRT_10BIT_RD) << BIT_SHIFT_ABRT_NORSTRT_10BIT_RD)
#define BIT_GET_ABRT_NORSTRT_10BIT_RD(x)                    (((x) >>  BIT_SHIFT_ABRT_NORSTRT_10BIT_RD) & BIT_MASK_ABRT_NORSTRT_10BIT_RD)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ABRT_NORSTRT_SBYTE
 *  @{
 */
#define BIT_ABRT_NORSTRT_SBYTE                              BIT9
#define BIT_SHIFT_ABRT_NORSTRT_SBYTE                        9
#define BIT_MASK_ABRT_NORSTRT_SBYTE                         0x1
#define BIT_CTRL_ABRT_NORSTRT_SBYTE(x)                      (((x) &  BIT_MASK_ABRT_NORSTRT_SBYTE) << BIT_SHIFT_ABRT_NORSTRT_SBYTE)
#define BIT_GET_ABRT_NORSTRT_SBYTE(x)                       (((x) >>  BIT_SHIFT_ABRT_NORSTRT_SBYTE) & BIT_MASK_ABRT_NORSTRT_SBYTE)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ABRT_NORSTRT_HS
 *  @{
 */
#define BIT_ABRT_NORSTRT_HS                                 BIT8
#define BIT_SHIFT_ABRT_NORSTRT_HS                           8
#define BIT_MASK_ABRT_NORSTRT_HS                            0x1
#define BIT_CTRL_ABRT_NORSTRT_HS(x)                         (((x) &  BIT_MASK_ABRT_NORSTRT_HS) << BIT_SHIFT_ABRT_NORSTRT_HS)
#define BIT_GET_ABRT_NORSTRT_HS(x)                          (((x) >>  BIT_SHIFT_ABRT_NORSTRT_HS) & BIT_MASK_ABRT_NORSTRT_HS)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ABRT_SBYTE_ACKDET
 *  @{
 */
#define BIT_ABRT_SBYTE_ACKDET                               BIT7
#define BIT_SHIFT_ABRT_SBYTE_ACKDET                         7
#define BIT_MASK_ABRT_SBYTE_ACKDET                          0x1
#define BIT_CTRL_ABRT_SBYTE_ACKDET(x)                       (((x) &  BIT_MASK_ABRT_SBYTE_ACKDET) << BIT_SHIFT_ABRT_SBYTE_ACKDET)
#define BIT_GET_ABRT_SBYTE_ACKDET(x)                        (((x) >>  BIT_SHIFT_ABRT_SBYTE_ACKDET) & BIT_MASK_ABRT_SBYTE_ACKDET)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ABRT_HS_ACKDET
 *  @{
 */
#define BIT_ABRT_HS_ACKDET                                  BIT6
#define BIT_SHIFT_ABRT_HS_ACKDET                            6
#define BIT_MASK_ABRT_HS_ACKDET                             0x1
#define BIT_CTRL_ABRT_HS_ACKDET(x)                          (((x) &  BIT_MASK_ABRT_HS_ACKDET) << BIT_SHIFT_ABRT_HS_ACKDET)
#define BIT_GET_ABRT_HS_ACKDET(x)                           (((x) >>  BIT_SHIFT_ABRT_HS_ACKDET) & BIT_MASK_ABRT_HS_ACKDET)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ABRT_GCALL_RD
 *  @{
 */
#define BIT_ABRT_GCALL_RD                                BIT5
#define BIT_SHIFT_ABRT_GCALL_RD                          5
#define BIT_MASK_ABRT_GCALL_RD                           0x1
#define BIT_CTRL_ABRT_GCALL_RD(x)                        (((x) &  BIT_MASK_ABRT_GCALL_RD) << BIT_SHIFT_ABRT_GCALL_RD)
#define BIT_GET_ABRT_GCALL_RD(x)                         (((x) >>  BIT_SHIFT_ABRT_GCALL_RD) & BIT_MASK_ABRT_GCALL_RD)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ABRT_GCALL_NOACK
 *  @{
 */
#define BIT_ABRT_GCALL_NOACK                            BIT4
#define BIT_SHIFT_ABRT_GCALL_NACK                       4
#define BIT_MASK_ABRT_GCALL_NACK                        0x1
#define BIT_CTRL_ABRT_GCALL_NACK(x)                     (((x) &  BIT_MASK_ABRT_GCALL_NACK) << BIT_SHIFT_ABRT_GCALL_NACK)
#define BIT_GET_ABRT_GCALL_NACK(x)                      (((x) >>  BIT_SHIFT_ABRT_GCALL_NACK) & BIT_MASK_ABRT_GCALL_NACK)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ABRT_TXDAT_NACK
 *  @{
 */
#define BIT_ABRT_TXDAT_NACK                             BIT3
#define BIT_SHIFT_ABRT_TXDAT_NACK                       3
#define BIT_MASK_ABRT_TXDAT_NACK                        0x1
#define BIT_CTRL_ABRT_TXDAT_NACK(x)                     (((x) &  BIT_MASK_ABRT_TXDAT_NACK) << BIT_SHIFT_ABRT_TXDAT_NACK)
#define BIT_GET_ABRT_TXDAT_NACK(x)                      (((x) >>  BIT_SHIFT_ABRT_TXDAT_NACK) & BIT_MASK_ABRT_TXDAT_NACK)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ABRT_ADDR2_10BIT_NACK
 *  @{
 */
#define BIT_ABRT_ADDR2_10BIT_NACK                       BIT2
#define BIT_SHIFT_ABRT_ADDR2_10BIT_NACK                 2
#define BIT_MASK_ABRT_ADDR2_10BIT_NACK                  0x1
#define BIT_CTRL_ABRT_ADDR2_10BIT_NACK(x)               (((x) &  BIT_MASK_ABRT_ADDR2_10BIT_NACK) << BIT_SHIFT_ABRT_ADDR2_10BIT_NACK)
#define BIT_GET_ABRT_ADDR2_10BIT_NACK(x)                (((x) >>  BIT_SHIFT_ABRT_ADDR2_10BIT_NACK) & BIT_MASK_ABRT_ADDR2_10BIT_NACK)
/** @} */

/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ABRT_ADDR2_10BIT_NACK
 *  @{
 */
#define BIT_ABRT_ADDR1_10BIT_NACK                       BIT2
#define BIT_SHIFT_ABRT_ADDR1_10BIT_NACK                 2
#define BIT_MASK_ABRT_ADDR1_10BIT_NACK                  0x1
#define BIT_CTRL_ABRT_ADDR1_10BIT_NACK(x)               (((x) &  BIT_MASK_ABRT_ADDR1_10BIT_NACK) << BIT_SHIFT_ABRT_ADDR1_10BIT_NACK)
#define BIT_GET_ABRT_ADDR1_10BIT_NACK(x)                (((x) >>  BIT_SHIFT_ABRT_ADDR1_10BIT_NACK) & BIT_MASK_ABRT_ADDR1_10BIT_NACK)
/** @} */


/**
 *  @ingroup i2c_reg_bit_macro
 *  bit-operation macros for ABRT_ADDR_7BIT_NACK
 *  @{
 */
#define BIT_ABRT_ADDR_7BIT_NACK                         BIT0
#define BIT_SHIFT_ABRT_ADDR_7BIT_NACK                   0
#define BIT_MASK_ABRT_ADDR_7BIT_NACK                    0x1
#define BIT_CTRL_ABRT_ADDR_7BIT_NACK(x)                 (((x) &  BIT_MASK_ABRT_ADDR_7BIT_NACK) << BIT_SHIFT_ABRT_ADDR_7BIT_NACK)
#define BIT_GET_ABRT_ADDR_7BIT_NACK(x)                  (((x) >>  BIT_SHIFT_ABRT_ADDR_7BIT_NACK) & BIT_MASK_ABRT_ADDR_7BIT_NACK)
/** @} */


/**
  \brief  Type to access RTL8195B HP I2C function control register fields.
 */
typedef union {
    uint8_t w;
    struct {
        uint32_t en:1;                /*!< bit:   0       i2c enable */
        uint32_t pclk_en:1;           /*!< bit:   1       i2c pclk enable */
        uint32_t sclk_en:1;           /*!< bit:   2       i2c sclk enable */
        uint32_t rsvd:1;              /*!< bit:   3       reserved */
        uint32_t mux_en:1;            /*!< bit:   4       i2c mux enable */
        uint32_t mux_sel:2;           /*!< bit:   5 to 6  i2c mux selection
                                                            b'00: GPIOB 0~1
                                                            b'01: GPIOG 4~5
                                                            b'10: GPIOH 2~3
                                                            b'11: rsvd*/
    } b;
} hp_i2c_func_ctrl_entry_t, *php_i2c_func_ctrl_entry_t;

/**
  \brief  Type to access RTL8195B HP I2C function control register.
 */
typedef union {
    uint32_t w;                         /*!< Type      used for word access */
    struct {
        uint32_t en_0:1;                /*!< bit:   0       i2c0 enable */
        uint32_t pclk_en_0:1;           /*!< bit:   1       i2c0 pclk enable */
        uint32_t sclk_en_0:1;           /*!< bit:   2       i2c0 sclk enable */
        uint32_t rsvd0:1;               /*!< bit:   3       reserved */
        uint32_t mux_en_0:1;            /*!< bit:   4       i2c0 mux enable */
        uint32_t mux_sel_0:2;           /*!< bit:   5 to 6  i2c0 mux selection
                                                            b'00: GPIOB 0~1
                                                            b'01: GPIOG 4~5
                                                            b'10: GPIOH 2~3
                                                            b'11: rsvd*/
        uint32_t rsvd1:9;               /*!< bit:   7 to 15 reserved */

        uint32_t en_2:1;                /*!< bit:   16      i2c2 enable */
        uint32_t pclk_en_2:1;           /*!< bit:   17      i2c2 pclk enable */
        uint32_t sclk_en_2:1;           /*!< bit:   18      i2c2 sclk enable */
        uint32_t rsvd2:2;               /*!< bit:   19      reserved */
        uint32_t mux_en_2:1;            /*!< bit:   20      i2c2 mux enable */
        uint32_t mux_sel_2:2;           /*!< bit:   21 to 22 i2c2 mux selection
                                                            b'00: GPIOB 2~3
                                                            b'01: GPIOG 6~7
                                                            b'10: GPIOE 14~15
                                                            b'11: rsvd*/
        uint32_t rsvd3:1;               /*!< bit:   23      reserved */

        uint32_t en_3:1;                /*!< bit:   24      i2c3 enable */
        uint32_t pclk_en_3:1;           /*!< bit:   25      i2c3 pclk enable */
        uint32_t sclk_en_3:1;           /*!< bit:   26      i2c3 sclk enable */
        uint32_t rsvd4:1;               /*!< bit:   27      reserved */
        uint32_t mux_en_3:1;            /*!< bit:   28      i2c3 mux enable */
        uint32_t mux_sel_3:2;           /*!< bit:   29 to 30 i2c3 mux selection
                                                            b'00: GPIOB 4~5
                                                            b'01: GPIOG 8~9
                                                            b'10: GPIOF 10, 4
                                                            b'11: rsvd*/
    } b;                                /*!< Structure used for bit  access */
} hp_i2c_func_ctrl_t, *php_i2c_func_ctrl_t;


/** \brief i2c mode
*/
enum i2c_mode_e {
    I2CSlaveMode    =   0,                  /*!< 0: for i2c slave mode    */
    I2CMasterMode   =   1,                  /*!< 1: for i2c master mode    */
};

/** \brief i2c read/write
*/
enum i2c_read_write_e {
    I2CWrite        =   0,                  /*!< 0: for i2c write command    */
    I2CRead         =   1,                  /*!< 1: for i2c read command    */
};

/** \brief i2c address mode
*/
enum i2c_addr_mode_e {
    I2CAddress7bit     =   0,               /*!< 0: for i2c 7-bit address mode    */
    I2CAddress10bit    =   1,               /*!< 1: for i2c 10-bit address mode    */
};

/** \brief i2c speed mode
*/
enum i2c_spd_mode_e {
    I2CStandardSpeed    =   1,              /*!< 1: for i2c standard speed mode    */
    I2CFastSpeed        =   2,              /*!< 2: for i2c fast speed mode    */
    I2CHighSpeed        =   3,              /*!< 3: for i2c high speed mode    */
};

