apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_i2c.h
/** \brief i2c feature status
*/
enum i2c_enable_status_e {
    I2CDisable      =   0,                  /*!< 0: for i2c disable state    */
    I2CEnable       =   1,                  /*!< 1: for i2c enable state    */
    I2CForceDisable =   2,                  /*!< 2: for i2c force disable enable state    */
};

/** \brief i2c dma type
*/
enum i2c_dma_mod_e {
    I2CDmaDwc   =   0,                      /*!< 0: for i2c dwc dma mode    */
    I2CDmaReg   =   1,                      /*!< 1: for i2c register-based dma mode    */
    I2CDmaDes   =   2,                      /*!< 2: for i2c descritptor mode    */
};

/** \brief i2c general call or start byte
*/
enum i2c_gc_sb_e {
    I2CGeneralCall      =   0,                      /*!< 0: for i2c master could general call    */
    I2CStartByte        =   1,                      /*!< 1: for i2c master could START byte    */
};

/** \brief i2c bus status
*/
enum i2c_bus_status_e {
    I2CBusIdle          =   0,                      /*!< 0: for i2c bus in idle state    */
    I2CBusAddressPhase  =   1,                      /*!< 1: for i2c bus in address phase    */
    I2CBusDataPhase     =   2,                      /*!< 2: for i2c bus in data phase    */
    I2CBusClockStretch  =   3,                      /*!< 2: for i2c bus in clock stretch phase    */
};

/** \brief i2c module state
*/
enum i2c_status_e {
    I2CStatusUninitial      =   0x00,               /*!< 0x00: i2c uninitial state   */
    I2CStatusInitialized    =   0x01,               /*!< 0x01: i2c initialized state   */
    I2CStatusIdle           =   0x02,               /*!< 0x02: i2c idle state   */

    I2CStatusTxReady        =   0x03,               /*!< 0x03: i2c TX ready state   */
    I2CStatusTxing          =   0x04,               /*!< 0x04: i2c TXing state   */

    I2CStatusRxReady        =   0x05,               /*!< 0x05: i2c RX ready state   */
    I2CStatusRxing          =   0x06,               /*!< 0x06: i2c RXing state   */

    I2CStatusDisable        =   0x07,               /*!< 0x07: i2c disabled state   */
    I2CStatusError          =   0x10,               /*!< 0x10: i2c error state   */
    I2CStatusTimeOut        =   0x11,               /*!< 0x11: i2c time-out state   */
};

/** \brief i2c module operation
*/
enum i2c_operation_mode_e {
    I2CModePoll         =   0x00,                   /*!< 0x00: i2c module in poll mode   */
    I2CModeInterrupt    =   0x01,                   /*!< 0x01: i2c module in interrupt mode   */
    I2CModeDMA          =   0x02,                   /*!< 0x02: i2c module in DMA mode   */
};

/** \brief i2c module master special functions
*/
enum i2c_master_speicial_func_e {
    I2CAddressRetry     =   0x01,                   /*!< 0x01: i2c master mode could do address retry   */
    I2CMasterRestart    =   0x02,                   /*!< 0x02: i2c master mode could send RESTART   */
};

/** \brief i2c module slave special functions
*/
enum i2c_slave_speicial_func_e {
    I2CSlaveRXBySTPSTR =   0x01,                    /*!< 0x01: i2c slave mode receiving would end by STOP or START bit*/
};

/** \brief i2c module error type
*/
enum i2c_err_type_e {
    I2CErrorNone            =   0x00,               /*!< 0x00: i2c has no errors    */
    I2CErrorRxUnder         =   0x01,               /*!< 0x01: i2c has RX underflow error    */
    I2CErrorRxOver          =   0x02,               /*!< 0x02: i2c has RX overflow error    */
    I2CErrorRxDone          =   0x03,               /*!< 0x03: i2c has RX Done error    */
    I2CErrorTxOver          =   0x04,               /*!< 0x04: i2c has TX overflow error    */
    I2CErrorTxAbort         =   0x08,               /*!< 0x08: i2c has TX abort error    */
    I2CErrorSlaveTxNack     =   0x10,               /*!< 0x10: i2c has slave TX NACK error    */

    I2CErrorMasterAddrNack  =   0x12,               /*!< 0x12: i2c master sends address and gets NACK    */
    I2CErrorMasterDataNack  =   0x13,               /*!< 0x13: i2c master sends data and gets NACK    */
    I2CErrorMasterLostArb   =   0x14,               /*!< 0x14: i2c master lost bus arbitration    */

    I2CErrorRxCmdTimeOut    =   0x21,               /*!< 0x21: i2c master sends RX command and time-out happens    */
    I2CErrorRxFIFOTimeOut   =   0x22,               /*!< 0x22: i2c read RX data and time-out happens    */
    I2CErrorTxCmdTimeOut    =   0x23,               /*!< 0x23: i2c master sends TX command and time-out happens    */
    I2CErrorTxFIFOTimeOut   =   0x24,               /*!< 0x24: i2c fill TX data and time-out happens    */

    I2CErrorTxAddrTimeOut   =   0x25,               /*!< 0x25: i2c master sends TX address retry and time-out happens    */
    I2CErrorRxAddrTimeOut   =   0x26,               /*!< 0x26: i2c master sends RX address retry and time-out happens    */
    I2CErrorTarTimeOut      =   0x27,               /*!< 0x27: i2c master sets target address and time-out happens    */

    I2CErrorSlaveLostArb    =   0x30,               /*!< 0x30: i2c slave lost bus arbitration    */
    I2CErrorSlaveFlushFIFO  =   0x31,               /*!< 0x31: i2c slave flushes FIFO when getting RD Req. and TX FIFO
                                                               is NOT empty. */
    I2CErrorSlaveRDCmdInTX  =   0x32,               /*!< 0x32: i2c slave acts as a transmitter and a Read Cmd written
                                                               into TX FIFO */
};

/** \brief i2c dma channel status
*/
enum i2c_dma_ch_status_e {
    I2CDmaChNone            =   0x00,               /*!< 0x00: i2c got no channel    */
    I2CDmaChGot             =   0x01,               /*!< 0x00: i2c got a channel    */
    I2CDmaChInitialed       =   0x02,               /*!< 0x00: i2c got a channel and initialized it    */
};

/*  Macros for i2c SCL timing constant  */
/** @defgroup i2c_reg_scl_clock_constant I2C REG SCL CLOCK CONSTANT
 *  i2c SCL timing constant
 *  @{
 */
#define I2C_SS_MIN_SCL_HTIME    4000        //the unit is ns.
#define I2C_SS_MIN_SCL_LTIME    4700        //the unit is ns.

#define I2C_FS_MODIFY
#ifdef I2C_FS_MODIFY
#define I2C_FS_MIN_SCL_HTIME    900         //the unit is ns.
#define I2C_FS_MIN_SCL_LTIME    1000        //the unit is ns.
#else
#define I2C_FS_MIN_SCL_HTIME    600         //the unit is ns.
#define I2C_FS_MIN_SCL_LTIME    1300        //the unit is ns.
#endif

