apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_i2c.h
        hal_status_t (*hal_i2c_init) (hal_i2c_adapter_t *phal_i2c_adapter, uint8_t scl_pin, uint8_t sda_pin);
        hal_status_t (*hal_i2c_deinit) (hal_i2c_adapter_t *phal_i2c_adapter);
        hal_status_t (*hal_i2c_load_default) (hal_i2c_adapter_t *phal_i2c_adapter, uint8_t index);
        hal_status_t (*hal_i2c_set_tar) (hal_i2c_adapter_t *phal_i2c_adapter, uint8_t mst_rw);
        hal_status_t (*hal_i2c_send_addr_retry) (hal_i2c_adapter_t *phal_i2c_adapter);
        hal_status_t (*hal_i2c_send_poll) (hal_i2c_adapter_t *phal_i2c_adapter);
        hal_status_t (*hal_i2c_send_intr) (hal_i2c_adapter_t *phal_i2c_adapter);
        //hal_status_t (*hal_i2c_send_dma_init) (hal_i2c_adapter_t *phal_i2c_adapter);
        //hal_status_t (*hal_i2c_send_dma_deinit) (hal_i2c_adapter_t *phal_i2c_adapter);
        //hal_status_t (*hal_i2c_send_dma) (hal_i2c_adapter_t *phal_i2c_adapter);
        //hal_status_t (*hal_i2c_send) (hal_i2c_adapter_t *phal_i2c_adapter);
        hal_status_t (*hal_i2c_recv_addr_retry) (hal_i2c_adapter_t *phal_i2c_adapter);
        hal_status_t (*hal_i2c_recv_poll) (hal_i2c_adapter_t *phal_i2c_adapter);
        hal_status_t (*hal_i2c_recv_intr) (hal_i2c_adapter_t *phal_i2c_adapter);
        //hal_status_t (*hal_i2c_recv_dma_init) (hal_i2c_adapter_t *phal_i2c_adapter);
        //hal_status_t (*hal_i2c_recv_dma_deinit) (hal_i2c_adapter_t *phal_i2c_adapter);
        //hal_status_t (*hal_i2c_recv_dma) (hal_i2c_adapter_t *phal_i2c_adapter);
        //hal_status_t (*hal_i2c_receive) (hal_i2c_adapter_t *phal_i2c_adapter);
        hal_status_t (*hal_i2c_set_sar) (hal_i2c_adapter_t *phal_i2c_adapter, uint8_t sar_idx, uint16_t slv_addr);
        uint32_t (*hal_i2c_slv_recv_poll) (hal_i2c_adapter_t *phal_i2c_adapter);
        uint32_t (*hal_i2c_slv_recv_intr) (hal_i2c_adapter_t *phal_i2c_adapter);
        //uint32_t (*hal_i2c_slv_recv_dma) (hal_i2c_adapter_t *phal_i2c_adapter);
        //hal_status_t (*hal_i2c_slv_recv) (hal_i2c_adapter_t *phal_i2c_adapter);
        uint32_t (*hal_i2c_slv_send_poll) (hal_i2c_adapter_t *phal_i2c_adapter);
        uint32_t (*hal_i2c_slv_send_intr) (hal_i2c_adapter_t *phal_i2c_adapter);
        //uint32_t (*hal_i2c_slv_send_dma) (hal_i2c_adapter_t *phal_i2c_adapter);
        //hal_status_t (*hal_i2c_slv_send) (hal_i2c_adapter_t *phal_i2c_adapter);
        void (*hal_i2c_dma_irq_handler) (void *data);
        void (*hal_i2c_mst_irq_handler) (void *data);
        void (*hal_i2c_slv_irq_handler) (void *data);
        uint32_t reserved[16];  // reserved space for next ROM code version function table extending.
} hal_i2c_func_stubs_t;

/** @} */ /* End of group hs_hal_i2c */

#ifdef __cplusplus
}
#endif

#endif /* _RTL8710C_I2C_H_ */

